[TRShieldGenerator X2EquipmentTemplate]
FriendlyName="Генератор щита"
FriendlyNamePlural="Генератор щита"
BriefSummary="Полезный предмет, обеспечивающий ограниченное количество регенерации щита. Помогает повысить живучесть солдата в бою"
TacticalText="<Bullet/> Обеспечивает регенерацию щита при ограниченных затратах.<br/><Bullet/> Работает в сочетании с другим оборудованием, обеспечивающим абляционные защитные точки" 

[TRShieldRegenAbility X2AbilityTemplate]
LocFriendlyName="Генератор щита"
LocLongDescription="Восстанавливает щит"
LocHelpText="Восстанавливает щит"
LocFlyOverText="Регенерация аблятивных очков"